HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxEdsadc_bf.h
/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CH8RUN */
#define IFX_EDSADC_GLOBRC_CH8RUN_OFF (8u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.CH9RUN */
#define IFX_EDSADC_GLOBRC_CH9RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.CH9RUN */
#define IFX_EDSADC_GLOBRC_CH9RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.CH9RUN */
#define IFX_EDSADC_GLOBRC_CH9RUN_OFF (9u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.M0RUN */
#define IFX_EDSADC_GLOBRC_M0RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.M0RUN */
#define IFX_EDSADC_GLOBRC_M0RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.M0RUN */
#define IFX_EDSADC_GLOBRC_M0RUN_OFF (16u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.M1RUN */
#define IFX_EDSADC_GLOBRC_M1RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.M1RUN */
#define IFX_EDSADC_GLOBRC_M1RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.M1RUN */
#define IFX_EDSADC_GLOBRC_M1RUN_OFF (17u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.M2RUN */
#define IFX_EDSADC_GLOBRC_M2RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.M2RUN */
#define IFX_EDSADC_GLOBRC_M2RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.M2RUN */
#define IFX_EDSADC_GLOBRC_M2RUN_OFF (18u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.M3RUN */
#define IFX_EDSADC_GLOBRC_M3RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.M3RUN */
#define IFX_EDSADC_GLOBRC_M3RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.M3RUN */
#define IFX_EDSADC_GLOBRC_M3RUN_OFF (19u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.M4RUN */
#define IFX_EDSADC_GLOBRC_M4RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.M4RUN */
#define IFX_EDSADC_GLOBRC_M4RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.M4RUN */
#define IFX_EDSADC_GLOBRC_M4RUN_OFF (20u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.M5RUN */
#define IFX_EDSADC_GLOBRC_M5RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.M5RUN */
#define IFX_EDSADC_GLOBRC_M5RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.M5RUN */
#define IFX_EDSADC_GLOBRC_M5RUN_OFF (21u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.M6RUN */
#define IFX_EDSADC_GLOBRC_M6RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.M6RUN */
#define IFX_EDSADC_GLOBRC_M6RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.M6RUN */
#define IFX_EDSADC_GLOBRC_M6RUN_OFF (22u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.M7RUN */
#define IFX_EDSADC_GLOBRC_M7RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.M7RUN */
#define IFX_EDSADC_GLOBRC_M7RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.M7RUN */
#define IFX_EDSADC_GLOBRC_M7RUN_OFF (23u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.M8RUN */
#define IFX_EDSADC_GLOBRC_M8RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.M8RUN */
#define IFX_EDSADC_GLOBRC_M8RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.M8RUN */
#define IFX_EDSADC_GLOBRC_M8RUN_OFF (24u)

/** \brief Length for Ifx_EDSADC_GLOBRC_Bits.M9RUN */
#define IFX_EDSADC_GLOBRC_M9RUN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_GLOBRC_Bits.M9RUN */
#define IFX_EDSADC_GLOBRC_M9RUN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_GLOBRC_Bits.M9RUN */
#define IFX_EDSADC_GLOBRC_M9RUN_OFF (25u)

/** \brief Length for Ifx_EDSADC_ACCPROT_Bits.RG00 */
#define IFX_EDSADC_ACCPROT_RG00_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCPROT_Bits.RG00 */
#define IFX_EDSADC_ACCPROT_RG00_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCPROT_Bits.RG00 */
#define IFX_EDSADC_ACCPROT_RG00_OFF (0u)

/** \brief Length for Ifx_EDSADC_ACCPROT_Bits.RG01 */
#define IFX_EDSADC_ACCPROT_RG01_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCPROT_Bits.RG01 */
#define IFX_EDSADC_ACCPROT_RG01_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCPROT_Bits.RG01 */
#define IFX_EDSADC_ACCPROT_RG01_OFF (1u)

/** \brief Length for Ifx_EDSADC_ACCPROT_Bits.RG02 */
#define IFX_EDSADC_ACCPROT_RG02_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCPROT_Bits.RG02 */
#define IFX_EDSADC_ACCPROT_RG02_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCPROT_Bits.RG02 */
#define IFX_EDSADC_ACCPROT_RG02_OFF (2u)

/** \brief Length for Ifx_EDSADC_ACCPROT_Bits.RG03 */
#define IFX_EDSADC_ACCPROT_RG03_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCPROT_Bits.RG03 */
#define IFX_EDSADC_ACCPROT_RG03_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCPROT_Bits.RG03 */
#define IFX_EDSADC_ACCPROT_RG03_OFF (3u)

/** \brief Length for Ifx_EDSADC_ACCPROT_Bits.RG04 */
#define IFX_EDSADC_ACCPROT_RG04_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCPROT_Bits.RG04 */
#define IFX_EDSADC_ACCPROT_RG04_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCPROT_Bits.RG04 */
#define IFX_EDSADC_ACCPROT_RG04_OFF (4u)

/** \brief Length for Ifx_EDSADC_ACCPROT_Bits.RG05 */
#define IFX_EDSADC_ACCPROT_RG05_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCPROT_Bits.RG05 */
#define IFX_EDSADC_ACCPROT_RG05_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCPROT_Bits.RG05 */
#define IFX_EDSADC_ACCPROT_RG05_OFF (5u)

/** \brief Length for Ifx_EDSADC_ACCPROT_Bits.RG06 */
#define IFX_EDSADC_ACCPROT_RG06_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCPROT_Bits.RG06 */
#define IFX_EDSADC_ACCPROT_RG06_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCPROT_Bits.RG06 */
#define IFX_EDSADC_ACCPROT_RG06_OFF (6u)

/** \brief Length for Ifx_EDSADC_ACCPROT_Bits.RG07 */
#define IFX_EDSADC_ACCPROT_RG07_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCPROT_Bits.RG07 */
#define IFX_EDSADC_ACCPROT_RG07_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCPROT_Bits.RG07 */
#define IFX_EDSADC_ACCPROT_RG07_OFF (7u)

/** \brief Length for Ifx_EDSADC_ACCPROT_Bits.RG10 */
#define IFX_EDSADC_ACCPROT_RG10_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCPROT_Bits.RG10 */
#define IFX_EDSADC_ACCPROT_RG10_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_ACCPROT_Bits.RG10 */
#define IFX_EDSADC_ACCPROT_RG10_OFF (16u)

/** \brief Length for Ifx_EDSADC_ACCPROT_Bits.RGG */
#define IFX_EDSADC_ACCPROT_RGG_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCPROT_Bits.RGG */
#define IFX_EDSADC_ACCPROT_RGG_MSK (0x1u)

