HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxEdsadc_bf.h
/** \brief Offset for Ifx_EDSADC_CH_RECTCFG_Bits.SGND */
#define IFX_EDSADC_CH_RECTCFG_SGND_OFF (31u)

/** \brief Length for Ifx_EDSADC_CH_VCM_Bits.VREFXSEL */
#define IFX_EDSADC_CH_VCM_VREFXSEL_LEN (2u)

/** \brief Mask for Ifx_EDSADC_CH_VCM_Bits.VREFXSEL */
#define IFX_EDSADC_CH_VCM_VREFXSEL_MSK (0x3u)

/** \brief Offset for Ifx_EDSADC_CH_VCM_Bits.VREFXSEL */
#define IFX_EDSADC_CH_VCM_VREFXSEL_OFF (0u)

/** \brief Length for Ifx_EDSADC_CH_VCM_Bits.VXON */
#define IFX_EDSADC_CH_VCM_VXON_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_VCM_Bits.VXON */
#define IFX_EDSADC_CH_VCM_VXON_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_VCM_Bits.VXON */
#define IFX_EDSADC_CH_VCM_VXON_OFF (2u)

/** \brief Length for Ifx_EDSADC_CH_VCM_Bits.INPVC0 */
#define IFX_EDSADC_CH_VCM_INPVC0_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_VCM_Bits.INPVC0 */
#define IFX_EDSADC_CH_VCM_INPVC0_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_VCM_Bits.INPVC0 */
#define IFX_EDSADC_CH_VCM_INPVC0_OFF (16u)

/** \brief Length for Ifx_EDSADC_CH_VCM_Bits.INPVC1 */
#define IFX_EDSADC_CH_VCM_INPVC1_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_VCM_Bits.INPVC1 */
#define IFX_EDSADC_CH_VCM_INPVC1_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_VCM_Bits.INPVC1 */
#define IFX_EDSADC_CH_VCM_INPVC1_OFF (17u)

/** \brief Length for Ifx_EDSADC_CH_VCM_Bits.INPVC2 */
#define IFX_EDSADC_CH_VCM_INPVC2_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_VCM_Bits.INPVC2 */
#define IFX_EDSADC_CH_VCM_INPVC2_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_VCM_Bits.INPVC2 */
#define IFX_EDSADC_CH_VCM_INPVC2_OFF (18u)

/** \brief Length for Ifx_EDSADC_CH_VCM_Bits.INPVC3 */
#define IFX_EDSADC_CH_VCM_INPVC3_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_VCM_Bits.INPVC3 */
#define IFX_EDSADC_CH_VCM_INPVC3_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_VCM_Bits.INPVC3 */
#define IFX_EDSADC_CH_VCM_INPVC3_OFF (19u)

/** \brief Length for Ifx_EDSADC_CH_VCM_Bits.INNVC0 */
#define IFX_EDSADC_CH_VCM_INNVC0_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_VCM_Bits.INNVC0 */
#define IFX_EDSADC_CH_VCM_INNVC0_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_VCM_Bits.INNVC0 */
#define IFX_EDSADC_CH_VCM_INNVC0_OFF (20u)

/** \brief Length for Ifx_EDSADC_CH_VCM_Bits.INNVC1 */
#define IFX_EDSADC_CH_VCM_INNVC1_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_VCM_Bits.INNVC1 */
#define IFX_EDSADC_CH_VCM_INNVC1_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_VCM_Bits.INNVC1 */
#define IFX_EDSADC_CH_VCM_INNVC1_OFF (21u)

/** \brief Length for Ifx_EDSADC_CH_VCM_Bits.INNVC2 */
#define IFX_EDSADC_CH_VCM_INNVC2_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_VCM_Bits.INNVC2 */
#define IFX_EDSADC_CH_VCM_INNVC2_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_VCM_Bits.INNVC2 */
#define IFX_EDSADC_CH_VCM_INNVC2_OFF (22u)

/** \brief Length for Ifx_EDSADC_CH_VCM_Bits.INNVC3 */
#define IFX_EDSADC_CH_VCM_INNVC3_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_VCM_Bits.INNVC3 */
#define IFX_EDSADC_CH_VCM_INNVC3_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_VCM_Bits.INNVC3 */
#define IFX_EDSADC_CH_VCM_INNVC3_OFF (23u)

/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXEDSADC_BF_H */
